# Tap repositories and their packages
tap 'homebrew/dupes'

tap 'homebrew/games'

tap 'homebrew/versions'

tap 'phinze/cask'
brew 'brew-cask'

tap 'rcmdnk/brewall'
brew 'brewall'

tap 'supermomonga/splhack'
brew 'cmigemo-mk'
brew 'ctags-objc-ja'
brew 'gettext-mk'
brew 'macvim-kaoriya'

tap 'waltarix/customs'
brew 'coreutils'
brew 'emacs'
brew 'zsh'


# Cask packages
cask 'google-chrome'

# Other Homebrew packages
brew 'autoconf'
brew 'cscope'
brew 'dpkg'
brew 'gdbm'
brew 'ghc'
brew 'git'
brew 'gnu-tar'
brew 'haskell-platform'
brew 'macvim'
brew 'mercurial'
brew 'mongodb'
brew 'mysql'
brew 'nkf'
brew 'openssl'
brew 'pcre'
brew 'pidof'
brew 'pkg-config'
brew 'play'
brew 'redis'
brew 'sbt'
brew 'scala'
brew 'tig'
brew 'wget'
brew 'xz'
brew 'sl'
